[{"title":"Why Windows 8.1 is the best Windows version","slug":"win-81","html":"<h3 id=\"this-blog-will-be-a-test-of-my-blog-writing-skills-please-tell-me-if-this-needs-any-improvements\">This blog will be a test of my blog writing skills, please tell me if this needs any improvements</h3>\n<h1 id=\"introduction\">Introduction</h1>\n<p>Windows 8.1 is the best Windows version I&#39;ve ever used in my life, it was my main operating system during 2013-2017, was truly a great operating system that ran flawlessly on my Core 2 Duo machine at the time.</p>\n<p>The successor of 8.1, Windows 10, really dipped in quality in my opinion, that thing was much slower.</p>\n<p>I&#39;ll be talking about both desktop and mobile.</p>\n<h1 id=\"desktop\">Desktop</h1>\n<h2 id=\"the-thing-people-hate-the-most-about-it-the-metro-ui\">The thing people hate the most about it, the metro UI.</h2>\n<p>A lot of people criticize Windows 8.1 because of it&#39;s Metro UI which was introduced with Windows 8, but I honestly LOVE the Metro UI in Windows 8.1, the start screen is the most customization Windows has ever gotten out of the box.</p>\n<img src=\"/assets/Images/bloggeneral/win-81/start_screen_background_customize.jpg\" style=\"float:center;\" alt=\"Windows 8.1 start screen customization\">\n\n<p>As you can see here, there&#39;s a lot of backgrounds to choose from, and you can also change the colors, that&#39;s somehow the most Windows ever gotten for customization (if we don&#39;t count the Windows 9x UI color changing).</p>\n<p>Metro isn&#39;t that bad on desktop if you get used to it, but it is the best UI for touch screens as seen in the video below.</p>\n<iframe width=\"600\" height=\"340\" src=\"https://www.youtube.com/embed/uZvqMptBl6o\"></iframe>\n<br>\nWindows 10 and 11 lack a lot of these gestures that make Windows more usable on touch screens, infact I think no desktop OS is this good on touch screens (besdies GNOME).\n\n<p>Though I have to admit, applications themselves are a bit lacking, but they aren&#39;t any better on Windows 10 tbh.</p>\n<h2 id=\"its-the-best-choice-for-a-legacy-windows-version\">It&#39;s the best choice for a legacy Windows version</h2>\n<p>Something most people don&#39;t know is that Windows 8.1 is far more optimized than Windows 7, at least according to my own testing, which was done in a virtual machine (QEMU/KVM to be specific), on a Hitachi hard drive I found in trash, results were as following: Windows 8.1 booted 1.5 minutes faster than Windows 7 (30 seconds vs 2 minutes), that was with fast boot off.</p>\n<p>Also keep in mind that it&#39;s more recent than Windows 7, so more apps support it, it also has a lot of features that Windows 7 didn&#39;t have, such as full UEFI suppor, a better version of Bitlocker, NVMe support, and it added the quick access menu (accessible by right clicking the start button).</p>\n<h1 id=\"mobile\">Mobile</h1>\n<p>I won&#39;t say much here, I just love the shit out of Windows phone 8.1, it had a great UI, it was GREAT if you had an amoled screen, the keyboard was the best touch keyboard ever <strong>AND NOTHING</strong> replicated it yet, it was the first operating system ever to introduce swipe typing, the thing was smoooth as fuck even on the low end devices, yes it had a lack of apps, but it was a phone that got shit done.</p>\n<p>Windows 10 mobile ruined all of that, it was laggy and choppy, the UI was worse, the keyboard felt fucked for some reason.</p>\n","date":"15/05/2023"},{"title":"Saraistupid finally got a good website","slug":"new-website","html":"<p>Welcome to my website! I&#39;ll be writing blogs here from time to time, this will just be my own personal space</p>\n<p>This site is a fork of <a href=\"https://starpelly.com/\">Starpelly&#39;s website</a></p>\n<p>This website is Child Pornography free! (I hope)\n<img src=\"https://cdn.discordapp.com/emojis/1064217837377429574.webp?size=256&quality=lossless\" style=\"width: 100px; float:right; margin:20px; margin-right:-20px;\" alt=\"\"></p>\n<br>\n<br>\n\n<h2 id=\"view-count\">View count:</h2>\n<p>if this doesn&#39;t load then moe-counter is down</p>\n<p align=\"center\">\n   <img src=\"https://count.getloli.com/get/@Saraistupidgithubio\" alt=\":name\" />\n</p>\n","date":"14/05/2023"}]