[{"title":"Why I believe in transmedicalism.","slug":"transmed","html":"<br>\n<br>\n<br>\n\n<h2 id=\"this-might-be-badly-formatted-and-badly-written-this-is-my-second-blog-post-so-please-excuse-any-mistakes\">This might be badly formatted and badly written, this is my second blog post so please excuse any mistakes.</h2>\n<h1 id=\"introduction\">Introduction</h1>\n<p>Transmedicalism is the belief that being transgender is primarily a medical issue, not primarily a social issue.\nThe basis of transmedicalism is believing that one needs to have gender dysphoria to be transgender.</p>\n<h1 id=\"is-transmedicalism-as-bad-as-it-seems\">Is transmedicalism as bad as it seems?</h1>\n<p>No, there&#39;s a popular belief that transmedicalism is against non-binary people, which is mostly untrue[1][2], it depends on the beliefs of the transmed, one may believe in dysphoric non-binaries, while another doesn&#39;t believe in it at all</p>\n<p>Same could apply to the belief that transmeds believe in gender roles, which is again mostly untrue.[1]</p>\n<p>Transmedicalism is not conforming to conservatives or their beliefs, most transmeds are massively against conservativsm/traditionalism.</p>\n<p>The basis of transmedicalism is to just believe that one has to have gender dysphoria, that&#39;s it. Nothing more than that, anything over that is just pre-individual basis</p>\n<h1 id=\"my-exact-belief\">My exact belief</h1>\n<p>My transmedicalist belief is the basis of transmedicalism, with an extra requirement, being intention to go on HRT, preferably DIY.</p>\n<h2 id=\"why-diy\">Why DIY?</h2>\n<p>As an anarchist, I believe that anyone should be able to access any kind of medicine they want, all drugs should be over the counter.</p>\n<p>And in most cases, doctors and clinics are using outdated (underdosed estradiol/estorgen, overdosed testosterone blockers/antiandrogens, etc...) [3]</p>\n<p>Getting HRT through legal means is supporting the idea that prescriptions should exist and is massively depending on a state or laws to exist.</p>\n<h1 id=\"but-why-do-you-believe-in-transmedicalism\">But why do you believe in transmedicalism?</h1>\n<p>I&#39;m someone suffering from severe gender dysphoria, and I really need any kind of help for my case, HRT is enough but I want a full cure. The demedicalization of transgenderism is gonna make the possibility of an actual cure much closer to impossible.</p>\n<p>I cannot find any kind of self-id argument that I believe in, and I know this is brought up so many times, but stuff like xenogenders make no sense for me either, they&#39;re making a conservative joke seem like a reality.</p>\n<p>Self-ID arguments cannot hold up to legalize existence of trans people in any way. Infact it could worsen it in so many ways.</p>\n<h1 id=\"but-arent-truscums-usually-annoying-shits\">But aren&#39;t truscums usually annoying shits?</h1>\n<p>Well, that&#39;s massively wrong, BUT if we are talking about Blaire White and Kelly Cadigan type transmeds. Yes! Abso-fucking-lutely! In my opinion they&#39;re on the same level as trenders, annoying people trying to get extra special minority points, but difference here is that they&#39;re cucks to conservatives. (funny enough one of my nickanmes is Blaire Brown)</p>\n<p>I believe that actively going after trenders or people who believe in self-id are massively stupid and annoying and should do something better with their time.</p>\n<p>Thanks for coming to my talk :33333</p>\n<h1 id=\"references\">References</h1>\n<ol>\n<li><a href=\"https://www.reddit.com/r/truscum/wiki/index/\">r/truscum wiki (yes, I&#39;m unironically linking a subreddit)</a></li>\n<li><a href=\"https://rationalwiki.org/wiki/Transmedicalism\">Rationalwiki&#39;s article on transmedicalism</a></li>\n<li><a href=\"https://twitter.com/girlcel_/status/1697005569234608500\">A Twitter/X thread</a>, or <a href=\"https://i.imgur.com/DQrX1ZN.png\">an archive</a></li>\n</ol>\n","date":"05/10/2023"},{"title":"Why Windows 8.1 is the best Windows version","slug":"win-81","html":"<h3 id=\"this-article-will-be-a-test-of-my-blog-writing-skills-please-tell-me-if-this-needs-any-improvements\">This article will be a test of my blog writing skills, please tell me if this needs any improvements</h3>\n<h1 id=\"introduction\">Introduction</h1>\n<p>Windows 8.1 is the best Windows version I&#39;ve ever used in my life, it was my main operating system during 2013-2017, was truly a great operating system that ran flawlessly on my Core 2 Duo machine at the time.</p>\n<p>The successor of 8.1, Windows 10, really dipped in quality in my opinion, that thing was much slower.</p>\n<p>I&#39;ll be talking about both desktop and mobile.</p>\n<h1 id=\"desktop\">Desktop</h1>\n<h2 id=\"the-thing-people-hate-the-most-about-it-the-metro-ui\">The thing people hate the most about it, the metro UI.</h2>\n<p>A lot of people criticize Windows 8.1 because of it&#39;s Metro UI which was introduced with Windows 8, but I honestly LOVE the Metro UI in Windows 8.1, the start screen is the most customization Windows has ever gotten out of the box.</p>\n<img src=\"/assets/Images/bloggeneral/win-81/start_screen_background_customize.jpg\" style=\"float:center;\" alt=\"Windows 8.1 start screen customization\">\n\n<p>As you can see here, there&#39;s a lot of backgrounds to choose from, and you can also change the colors, that&#39;s somehow the most Windows ever gotten for customization (if we don&#39;t count the Windows 9x UI color changing).</p>\n<p>Metro isn&#39;t that bad on desktop if you get used to it, but it is the best UI for touch screens as seen in the video below.</p>\n<iframe width=\"600\" height=\"340\" src=\"https://www.youtube.com/embed/uZvqMptBl6o\"></iframe>\n<br>\nWindows 10 and 11 lack a lot of these gestures that make Windows more usable on touch screens, infact I think no desktop OS is this good on touch screens (besdies GNOME).\n\n<p>Though I have to admit, applications themselves are a bit lacking, but they aren&#39;t any better on Windows 10 tbh.</p>\n<h2 id=\"its-the-best-choice-for-a-legacy-windows-version\">It&#39;s the best choice for a legacy Windows version</h2>\n<p>Something most people don&#39;t know is that Windows 8.1 is far more optimized than Windows 7, at least according to my own testing, which was done in a virtual machine (QEMU/KVM to be specific), on a Hitachi hard drive I found in trash, results were as following: Windows 8.1 booted 1.5 minutes faster than Windows 7 (30 seconds vs 2 minutes), that was with fast boot off.</p>\n<p>Also keep in mind that it&#39;s more recent than Windows 7, so more apps support it, it also has a lot of features that Windows 7 didn&#39;t have, such as full UEFI suppor, a better version of Bitlocker, NVMe support, and it added the quick access menu (accessible by right clicking the start button).</p>\n<h1 id=\"mobile\">Mobile</h1>\n<p>I won&#39;t say much here, I just love the shit out of Windows phone 8.1, it had a great UI, it was GREAT if you had an amoled screen, the keyboard was the best touch keyboard ever <strong>AND NOTHING</strong> replicated it yet, it was the first operating system ever to introduce swipe typing, the thing was smoooth as fuck even on the low end devices, yes it had a lack of apps, but it was a phone that got shit done.</p>\n<p>Windows 10 mobile ruined all of that, it was laggy and choppy, the UI was worse, the keyboard felt fucked for some reason.</p>\n","date":"15/05/2023"},{"title":"Saraistupid finally got a good website","slug":"new-website","html":"<p>Welcome to my website! I&#39;ll be writing blogs here from time to time, this will just be my own personal space</p>\n<p>This site is a fork of <a href=\"https://starpelly.com/\">Starpelly&#39;s website</a></p>\n<p>This website is Child Pornography free! (I hope)\n<img src=\"https://cdn.discordapp.com/emojis/1064217837377429574.webp?size=256&quality=lossless\" style=\"width: 100px; float:right; margin:20px; margin-right:-20px;\" alt=\"\"></p>\n<br>\n<br>\n\n<h2 id=\"view-count\">View count:</h2>\n<p>if this doesn&#39;t load then moe-counter is down</p>\n<p align=\"center\">\n   <img src=\"https://count.getloli.com/get/@Saraistupidgithubio\" alt=\":name\" />\n</p>\n","date":"14/05/2023"}]