{"html":"<br>\n<br>\n<br>\n\n<h2 id=\"this-might-be-badly-formatted-and-badly-written-this-is-my-second-blog-post-so-please-excuse-any-mistakes\">This might be badly formatted and badly written, this is my second blog post so please excuse any mistakes.</h2>\n<h1 id=\"introduction\">Introduction</h1>\n<p>Transmedicalism is the belief that being transgender is primarily a medical issue, not primarily a social issue.\nThe basis of transmedicalism is believing that one needs to have gender dysphoria to be transgender.</p>\n<h1 id=\"is-transmedicalism-as-bad-as-it-seems\">Is transmedicalism as bad as it seems?</h1>\n<p>No, there&#39;s a popular belief that transmedicalism is against non-binary people, which is mostly untrue[1][2], it depends on the beliefs of the transmed, one may believe in dysphoric non-binaries, while another doesn&#39;t believe in it at all</p>\n<p>Same could apply to the belief that transmeds believe in gender roles, which is again mostly untrue.[1]</p>\n<p>Transmedicalism is not conforming to conservatives or their beliefs, most transmeds are massively against conservativsm/traditionalism.</p>\n<p>The basis of transmedicalism is to just believe that one has to have gender dysphoria, that&#39;s it. Nothing more than that, anything over that is just pre-individual basis</p>\n<h1 id=\"my-exact-belief\">My exact belief</h1>\n<p>My transmedicalist belief is the basis of transmedicalism, with an extra requirement, being intention to go on HRT, preferably DIY.</p>\n<h2 id=\"why-diy\">Why DIY?</h2>\n<p>As an anarchist, I believe that anyone should be able to access any kind of medicine they want, all drugs should be over the counter.\nAnd in most cases, doctors and clinics are using outdated (underdosed estradiol/estorgen, overdosed testosterone blockers/antiandrogens, etc...) [3]\nGetting HRT through legal means is supporting the idea that prescriptions should exist and is massively depending on a state or laws to exist.</p>\n<h1 id=\"but-why-do-you-believe-in-transmedicalism\">But why do you believe in transmedicalism?</h1>\n<p>I&#39;m someone suffering from severe gender dysphoria, and I really need any kind of help for my case, HRT is enough but I want a full cure. The demedicalization of transgenderism is gonna make the possibility of an actual cure much closer to impossible.</p>\n<p>I cannot find any kind of self-id argument that I believe in, and I know this is brought up so many times, but stuff like xenogenders make no sense for me either, they&#39;re making a conservative joke seem like a reality.</p>\n<p>Self-ID arguments cannot hold up to legalize existence of trans people in any way. Infact it could worsen it in so many ways.</p>\n<h1 id=\"but-arent-truscums-usually-annoying-shits\">But aren&#39;t truscums usually annoying shits?</h1>\n<p>Well, that&#39;s massively wrong, BUT if we are talking about Blaire White and Kelly Cadigan type transmeds. Yes! Abso-fucking-lutely! In my opinion they&#39;re on the same level as trenders, annoying people trying to get extra special minority points, but difference here is that they&#39;re cucks to conservatives. (funny enough one of my nickanmes is Blaire Brown)</p>\n<p>I believe that actively going after trenders or people who believe in self-id are massively stupid and annoying and should do something better with their time.</p>\n<p>Thanks for coming to my talk :33333</p>\n<h1 id=\"references\">References</h1>\n<ol>\n<li><a href=\"https://www.reddit.com/r/truscum/wiki/index/\">r/truscum wiki (yes, I&#39;m unironically linking a subreddit)</a></li>\n<li><a href=\"https://rationalwiki.org/wiki/Transmedicalism\">Rationalwiki&#39;s article on transmedicalism</a></li>\n<li><a href=\"https://twitter.com/girlcel_/status/1697005569234608500\">A Twitter/X thread</a>, or <a href=\"https://i.imgur.com/DQrX1ZN.png\">an archive</a></li>\n</ol>\n","title":"Why I believe in transmedicalism.","slug":"transmed","date":"05/10/2023"}